{
    "2025-03-09": [
        {
            "date": "2025-03-09",
            "title": "Ex-Apple leader has some blunt words for Elon Musk and Tesla",
            "link": "https://finance.yahoo.com/m/9d3e9476-ef2e-3927-85a6-39394097f2e4/ex-apple-leader-has-some.html",
            "pub_time": "2025-03-09 14:07:00",
            "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nUpgrade Now\nEx-Apple leader has some blunt words for Elon Musk and Tesla\nSamuel O'Brient\nSun, Mar 9, 2025, 3:07 PM\n4 min read\nIn This Article:\nTSLA\n-0.30%\nAAPL\n+1.59%\nOne of the defining trends of 2025, likely to carry far into next year and beyond, is the number of tech sector leaders who have embraced President Donald Trump.\nWhile Elon Musk has become one of his closest advisors, the list of tech CEOs who attended his inauguration included Meta Platform’s\n(\nMETA\n)\nMark Zuckerberg, Alphabet’s\n(\nGOOGL\n)\nSundar Pichai, and Amazon\n(\nAMZN\n)\nfounder Jeff Bezos.\n💰💸\nDon’t miss the move: SIGN UP for TheStreet’s FREE Daily newsletter\n💰💸\nApple\n(\nAAPL\n)\nCEO Tim Cook risked blowback from his customers when he made a sizable donation to Trump’s inaugural fund. And while Nvidia\n(\nNVDA\n)\nCEO Jensen Huang did not attend the inauguration, he has visited Trump at the White House.\nStill, not every prominent tech leader has come out in support of Trump or Musk. In fact, an engineer credited with helping launch one of the industry’s most influential companies recently issued some harsh words about how Musk is approaching his new position on Capitol Hill.\nApple co-founder Steve Wozniak isn't laughing at Elon Musk's recent antics at the DOGE or Tesla.picture alliance/Getty Images\nA member of tech’s old guard sounds off on Musk’s antics\nWhen most people think of Apple, they likely think of former CEO Steve Jobs and his iconic keynote addresses that helped usher in a new era of technology and innovation. But much of the company’s success as a tech pioneer is due to the man who served as Jobs' partner.\nRelated: Elon Musk is dealt a devastating legal blow that may set him back\nSteve Wozniak didn't achieve Jobs’ type of fame, but many experts have credited him with making the rise of Apple possible through his engineering feats. Known often as “Woz,” he is considered the inventor of both the Apple I and II computers, making the personal computing revolution possible.\nWozniak's iconic nice-guy demeanor is one factor that separates him from much of the tech sector. He’s known for his love of music and art and rarely posts about tech on social media.\nBut in a recent interview with CNBC, Woz didn’t hold back on letting the world know exactly where he stands on both Musk and his work with the so-called Department of Government Efficiency (DOGE) while also revealing how he feels about Musk’s company.\n“Sometimes you get so rich at these big companies, and you’re on top — it goes to your head,” Wozniak noted, adding that he wasn’t sure what had happened to Musk. “I definitely think that we should look for inefficiencies in government, but pretty much have a huge department that analyzes bit by bit by bit,” he stated.\nWozniak offered further speculation on Musk’s work at DOGE, noting that “bullying is the best way to think of it.” He added that he has always favored the little guy over the bully in any scenario and, likewise, the consumer of something over its producer.\nStory Continues\nThis consumer vs. producer analogy may seem odd, given the nature of the interview. But Wozinak later criticized Tesla’s\n(\nTSLA\n)\nvehicles, describing Musk’s company as “the worst in the world” at improving its user interface.\nOpenAI considers taking drastic action to stop Elon Musk\nElon Musk's recent DOGE decision raises major red flags\nAs Tesla stock plunges, burning questions surround Elon Musk\nWhile Wozniak is a Tesla owner himself, he has levied criticism against Musk several times. In 2017, he warned that the company could be overhyped, stating, “If [Tesla says] something is going to happen, don’t quite count on it.” In the years since, Tesla has gone on to miss many deadlines, lending support to Woz’s thesis.\nMusk may have slyly taken action against Wozniak\nSo far, Musk hasn’t issued a statement in response to Wozniak's calling him a bully and criticizing his EV company and style of work at DOGE. But recently, Wozniak revealed something that suggests Musk may have targeted him.\nRelated: Apple blames name-calling glitch on its new AI feature\nIn a February 17 post on Bluesky, he claimed that his X account had been blocked, and he suspected Musk could be responsible, stating:\n“Over the years, I have a few times called Musk a liar (across the country by 2016, then 2017) and thief (money for upgrades), on national TV even. Maybe that’s why my Twitter account has been blocked for a few months despite violating no rules. I can’t get it fixed.”\nGranted, Wozniak seems to have fully embraced Bluesky as a social media platform, as he has posted consistently since joining it. So far, Musk has not acknowledged the suggestion that he blocked Wozniak’s X account, but it does not appear that any move has been made to rectify it.\nRelated: Veteran fund manager unveils eye-popping S&P 500 forecast\nView Comments\nTerms\nand\nPrivacy Policy\nPrivacy & Cookie Settings\nMore Info\nRecommended Stories"
        },
        {
            "date": "2025-03-09",
            "title": "How to stop doomscrolling",
            "link": "https://finance.yahoo.com/m/a62c812f-44cf-3c93-959f-5734c0bcf9cb/how-to-stop-doomscrolling.html",
            "pub_time": "2025-03-09 14:00:00",
            "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nUpgrade Now\nHow to stop doomscrolling\nAmanda Silberling\nSun, Mar 9, 2025, 3:00 PM\n7 min read\nIn This Article:\nAAPL\n+1.59%\nThe world is bad sometimes, but it feels even worse if you can't stop staring into the all-consuming abyss that is the 6-inch screen of a smartphone, following you through space and time. It taunts you with its compact, light build that's small enough to slip into your pocket and take anywhere — yet its siren call is so strong that for some reason, we cannot sleep without our phone on our nightstands.\nAs we weather\nthe horrors around us\n, it may occur to you that you would feel calmer and more attentive and balanced if you did not pick up your phone dozens of times a day to doomscroll.\nIt's messing with our brains\nto intersperse our day with glimpses into the most extreme, engagement-baiting TikToks, only to flip over to X or Bluesky and see crushing news headlines.\nLike any bad habit, doomscrolling is hard to kick. But it's not hopeless — or at least, I hope it isn't. So, how do you stop doomscrolling? It's not all that easy, but at the very least, we have some ideas about how you can set yourself up for success.\nUnderstand that this isn't your fault\nFirst of all, you aren't the problem. The problem is that our lives have become so deeply intertwined with tech companies that are looking to capture as much of our time as possible. If I use my Apple Watch to track a workout, I end up seeing text messages crop up while I'm trying to catch my breath after running up a steep hill. If I go on Spotify to listen to a specific album, I open the app and immediately see recommendations for podcasts and audiobooks that I'm not typically interested in. Or if I download Snapchat solely for a group chat where my friends send pictures of their pets, then each pet picture comes with some advertisement, extraneous push notification, or AR marketing filter that I didn't sign up for. It's no wonder that our phones make us feel crazy.\nI don't believe that Mark Zuckerberg is sitting in his lair — probably within his \"metaverse\" — dreaming up ways to personally make my life worse. But it is the inherent nature of consumer tech companies: Our attention is what keeps them afloat, and the more we pay attention to them, the happier their investors are, and the stock prices rise, and so on. Even with the knowledge of how these companies operate, it's still difficult to break our bad habits. I will still open my Instagram account to see what my friend sent me, only to regain my consciousness 10 minutes later after I've watched dozens of Reels.\nSet up screen time limits, and take them seriously\nFor the first several years after Apple introduced the Screen Time feature on iPhones, I chose deliberately not to turn it on — I was afraid of what I might learn about myself. But that fear in itself told me that I have a problem. Knowledge is power, and if we know which apps are sucking up most of our time, then we can curb how much time we spend on them.\nStory Continues\nHere's how to set screen time limits for specific apps on iOS:\nOpen the Settings app.\nScroll down to Screen Time, which is denoted with an hourglass icon.\nHere, you can see your daily average screen time and set guardrails for yourself to hopefully lower that average.\nUnder Limit Usage, there are a few different ways you can reduce your screen time: downtime and app limits.\nDowntime\nsets a schedule of when you can use certain apps. Maybe you set downtime for the hours you usually sleep, or maybe you create a more customizable day-to-day schedule. If you find yourself going on Instagram during class too much, maybe that's a time to set a limit.\nRather than choosing which apps to limit during downtime, you set which apps you want to\nalways allow\n, which is also accessible under the Limit Usage menu. If you have friends and family abroad, for example, you probably want to make sure that you can always access WhatsApp. Or, if you're like me and sometimes need audiobooks to fall asleep, then maybe you'll allow unlimited Libby access.\nApp Limits\nis where you can set how much time you want to spend on certain apps per day. You could set individual limits for specific apps, or maybe you lump a category of apps together (Facebook, Instagram, Bluesky, TikTok, X, etc.) and set an overall time limit for those apps.\nApple's built-in Screen Time tools are effective, but they're a bit easy to circumvent; if you're watching a great TikTok and suddenly get a pop-up that your time is up, you can just tap a button to give yourself another 15 minutes … and then do the same thing after another 15 minutes go by.\nSome people opt to use third-party apps to motivate them to reduce their screen time, which can address potential pitfalls of Apple's existing functionality.\nHere are some apps that are designed to limit your screen time:\nScreenZen\n, available on iOS and Android, lets you create pop-ups that appear before you open certain apps. So, before you open Instagram, for example, you may see a 10-second pop-up that reads, \"Is this important?\" You can also have the app prompt you to take deep breaths before opening apps, and it gamifies your success at remaining under time limits. My friend is currently working with a 144-day streak, which they refuse to sacrifice for one quick jolt of ill-timed dopamine.\nOpal\n, available on iOS, Android, and the web, focuses more specifically on boosting productivity at work or at school. The app is more customizable in limiting screen time than Apple's built-in features. You can focus not just on times, but also on how often you open an app (e.g., maybe you only want to open the Instagram app three times a day).\nRoots\n, available on iOS, doesn't just focus on how much time you're spending on your phone, but also on the quality of that time. Some users especially love the app's \"Monk Mode,\" which can be activated to make it impossible to bypass any of its app limits — even if you go as far as deleting the app. But if you've been really diligent with your limits, you can unlock \"cheat days.\"\nWe rounded up some physical devices\nthat can help you stop looking at screens too much.\nStop doomscrolling by just doing something else\nSo, you've opened TikTok and your screen time limits have denied you access, but now you don't know what to do. Maybe you're standing in line at the coffee shop and need a distraction. And sure, in an ideal world, we could simply be bored without spontaneously combusting, but this isn't an ideal world.\nHere are some other things you can do on your phone that do not involve social media:\nRead a book.\nNo, really. On apps like\niBooks\nand\nKindle\n, you can change your settings so that you scroll to read a book, instead of flipping page by page. You're literally scrolling, but instead, maybe you'll learn something.\nDon't want to buy books? You don't have to!\nLibby\nconnects with your library card to let you access e-books and audiobooks from your phone.\nDon't know what to read? I'm so sorry, but you might have to go figure it out on BookTok.\nPlay games.\nSure, games can be addicting, too, but at least games won't inform you that the world has imploded in a new, unexpected way. Every app copies every other app, but in the case of bite-sized, once-per-day games, this is a good thing.\nThe\nNew York Times Games\napp will let you play quick games like Wordle, Strands, and the Mini Crossword, even if you aren't a subscriber. But the Gray Lady's games have been so successful that other apps are taking the bait.\nHear me out. The\ngames on\nLinkedIn\nare actually really fun. Sure, you may get jump-scared by a post from your old, bad boss, but Tango in particular is worth the risk.\nThis article originally appeared on TechCrunch at https://techcrunch.com/2025/03/09/how-to-stop-doomscrolling/\nView Comments\nTerms\nand\nPrivacy Policy\nPrivacy & Cookie Settings\nMore Info\nRecommended Stories"
        },
         {
            "date": "2025-03-09",
            "title": "How to stop doomscrolling",
            "link": "https://finance.yahoo.com/m/a62c812f-44cf-3c93-959f-5734c0bcf9cb/how-to-stop-doomscrolling.html",
            "pub_time": "2025-03-09 14:00:00",
             "content": "Apple announces multi-year partnership with Oprah Winfrey Friday, June 15, 2018 4:27 pm 18 Comments News Apple today announced a unique, multi-year content partnership with Oprah Winfrey, the esteemed producer, actress, talk show host, philanthropist and CEO of OWN. Together, Winfrey and Apple will create original programs that embrace her incomparable ability to connect with audiences around the world. Winfrey’s projects will be released as part of a lineup of original content from Apple. Source: Apple Inc."
        }
    ],
    "2025-03-08": [
        {
            "date": "2025-03-08",
            "title": "Apple (AAPL) Eyes 2026 Launch for $2000+ Foldable, AI-Driven iPhone",
            "link": "https://finance.yahoo.com/news/apple-aapl-eyes-2026-launch-205706274.html",
            "pub_time": "2025-03-08 20:57:06",
            "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nUpgrade Now\nApple (AAPL) Eyes 2026 Launch for $2000+ Foldable, AI-Driven iPhone\nGhazal Ahmed\nSat, Mar 8, 2025, 9:57 PM\n4 min read\nIn This Article:\nAAPL\n+1.59%\nWe recently published a list of\nTop 10 AI Stocks Dominating the Market Right Now\n. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other top AI stocks dominating the market right now.\nAttention is slowly shifting from US chip stocks to what analysts consider as the next big AI play: software. Investor enthusiasm has begun waning for semiconductor stocks due to tariff-driven volatility and the emergence of lower cost AI models from China’s DeepSeek. The AI chips transition is now paving the way for the second stage of the innovation cycle where software companies will begin to monetize AI breakthroughs.\nREAD ALSO:\n10 Hot AI News Updates Analysts are Monitoring\nand\n10 High-Potential AI Stocks to Watch Right Now\n“The second stage of the innovation cycle is when people start utilizing products and that’s when the software companies start getting paid … we’re now starting to see the ascendancy of the software part of the equation.”\nPreviously, software startups such as Harvey were dismissed by Silicon Valley investors. Investors used to take these software firms lightly, stating them as mere wrappers around OpenAI’s models. However, now the narrative is shifting and these AI wrappers are becoming quite popular today.\n“The market’s perception of companies like us… was that they’re GPT wrappers, referencing a derisive term used to suggest the repackaging of OpenAI’s models. If investors “were going to put money into something,” he added, “it needed to be into OpenAI or Anthropic.”\nHere is what another investor has to say:\n“Just like after the iPhone launched, there were millions of new mobile apps,” said Mignano, an investor in the AI notetaking service Granola, which uses technology from OpenAI and Anthropic. “Now with AI and LLMs, there will be millions of new AI products.”\nDeepSeek has also played its due part in leading the shift from chip stocks to software and similar AI plays.\n“Investors are looking for the next three-to-five-year stories … those companies that are going to benefit from what Nvidia has already done.”\nFor this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points  (\nsee more details here\n).\nStory Continues\nApple (AAPL) Eyes 2026 Launch for $2000+ Foldable, AI-Driven iPhone\nA wide view of an Apple store, showing the range of products the company offers.\nApple Inc. (NASDAQ:\nAAPL\n)\nNumber of Hedge Fund Holders: 166\nApple Inc. (NASDAQ:AAPL) is a technology company. On March 6, Apple analyst Ming-Chi Kuo of TF International Securities published a note on Wednesday predicting its first foldable iPhone by late 2026, highlighting more details on a foldable iPhone design that he had previously heard about.\nThe analyst, who focuses on Apple’s supply chain, forecasts that Apple’s foldable iPhone is likely to have a book-style design, a 7.8-inch inner screen, and an “AI-driven” experience. The analyst stated that the iPhone is going to be “top-tier” with a “crease-free inner display” and an expected retail price of over $2000. He further stated how the device could begin mass production in the last quarter of 2026.\n“A phone with such a high price point affords Apple a true higher-end luxury offering to balance out the push on lower-priced alternatives like the iPhone 16e.”\nOverall, AAPL\nranks 4th\non our list of top AI stocks dominating the market right now. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the\ncheapest AI stock\n.\nREAD NEXT:\n20 Best AI Stocks To Buy Now\nand\n30 Best Stocks to Buy Now According to Billionaires\nDisclosure: None. This article is originally published at\nInsider Monkey\n.\nView Comments\nTerms\nand\nPrivacy Policy\nPrivacy & Cookie Settings\nMore Info\nRecommended Stories"
        },
        {
            "date": "2025-03-08",
            "title": "Now Streaming: Judge may consider blocking Paramount-Skydance deal",
            "link": "https://finance.yahoo.com/news/now-streaming-judge-may-consider-165139613.html",
            "pub_time": "2025-03-08 16:51:39",
            "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nUpgrade Now\nNow Streaming: Judge may consider blocking Paramount-Skydance deal\nTipRanks\nSat, Mar 8, 2025, 5:51 PM\n4 min read\nIn This Article:\nNFLX\n-1.68%\nAMCX\n-1.12%\nGOOG\n+0.88%\nAMZN\n-0.72%\nAAPL\n+1.59%\nhttps://www.tipranks.com/news/the-fly/now-streaming-judge-may-consider-blocking-paramount-skydance-deal\n“Now Streaming” is The Fly’s weekly recap of the stories surrounding the biggest content streamers.\nDiscover the Best Stocks and Maximize Your Portfolio:\nSee what stocks are receiving\nStrong Buy ratings from top-rated analysts.\nFilter, analyze, and streamline your search for investment opportunities with\nTipRanks’ Stock Screener.\nPLAYING THIS WEEKEND:\nAmong this week’s most notable new streaming content is season one of Marvel Comics series “Daredevil: Born Again,” whose first two episodes are available to watch on Disney+\n(\nDIS). Meanwhile, Amazon Prime Video\n(\nAMZN) subscribers can watch British romantic comedy film “Picture This,” while Max\n(\nWBD) users can watch the first episode of the new season of comedy series “The Righteous Gemstones” on Sunday. Additionally, Netflix\n(\nNFLX) subscribers can catch Italian television series “The Leopard” as well as the new season of sports documentary series “Formula 1: Drive to Survive.”\nPARAMOUNT/SKYDANCE:\nA Delaware judge is open to weighing claims in a\nclass action\nlawsuit that Paramount’s\n(\nPARA) $8B sale to Skydance Media should be barred from closing because it short-changes public investors, Reuters’ Tom Hals\nblog post\nthat Prime Video will begin offering AI-aided dubbing on licensed movies and series that would not have been dubbed otherwise. AI-aided dubbing in English and Latin American Spanish will be available initially on 12 licensed movies and series, including titles such as El Cid: La Leyenda, Mi Mama Lora, and Long Lost. “At Prime Video, we believe in improving customers’ experience with practical and useful\nAI\ninnovation,” said Raf Soltanovich, VP of technology at Prime Video and Amazon MGM Studios. “AI-aided dubbing is only available on titles that do not have dubbing support, and we are eager to explore a new way to make series and movies more accessible and enjoyable.” This AI-aided pilot program is a hybrid approach to dubbing in which localization professionals collaborate with AI to ensure quality control. AI-aided processes like this one, which incorporate the right amount of human expertise, can enable localization for titles that would not otherwise be accessible to customers.”\nYOUTUBE:\nYouTube\n(\nGOOGL) is preparing a Netflix-like redesign of its TV app, with paid content from other streamers like Max and Paramount+ on the homepage, The Information’s Sahil Patel\nreported\nearlier this week. A day later, Alphabet\nannounced\nthat it has started expanding its Premium Lite pilot to users in the U.S. Premium Lite gives viewers a new, more affordable way to enjoy most videos on YouTube ad-free for $7.99 per month, the company added. In the coming weeks, YouTube will also make Premium Lite available to all users in its current pilot countries, namely Thailand, Germany, and Australia.\nStory Continues\nMAX/TURKEY:\nMax will officially launch in Turkey on Tuesday, April 15, Warner Bros. Discovery\nannounced\n. “Turkish streaming service BluTV will evolve into Max, an advanced global platform with enhanced features and functionality, leveraging BluTV’s local storytelling power and combining it with an even richer lineup of content… As one of the most populous countries in the EMEA region, with more people than Germany, U.K, or France, the launch in Turkey presents a major opportunity to entertain and engage millions of new fans with high quality content across film and television from WBD’s world class studios,” the company stated.\nESPN/MLB:\nLast year, ESPN chairman Jimmy Pitaro visited MLB commissioner Rob Manfred, carrying a harsh message: The company thinks baseball’s TV rights are declining in value, Jared Diamond and Isabella Simonetti of The Wall Street Journal\nreported\nthis week. ESPN has been paying $550M a year to show baseball games, which is already hundreds of millions less than prior years. Now, ESPN plans to exercise an opt-out clause to escape the final three seasons of its contract with the MLB, the Journal said, according to people familiar with the matter.\nLOOP UPS DISNEY PT:\nLoop Capital raised the firm’s price target on Disney to $130 from $125 and maintained a Buy rating on the shares. The company’s FY25 guidance appears conservative, implying that the next 9-months EPS is down y/y, but assuming Snow White – an expensive title with mixed early reception being released later this month – is not a problem, guidance and estimates should rise, the analyst tells investors in a research note. Disney’s DTV profits are growing quicker than linear profits are declining, and the combined DTV/linear profits should top the recent combined peak of FY21 and keep growing, the firm adds.\nROKU UPGRADE:\nMoffettNathanson upgraded\nRoku\n(ROKU)\nto Neutral from Sell with a $70 price target as the firm believes 2025 is setting up as “a beat-and-raise story” for Roku. The firm’s long-term thesis on Roku has not changed and it still believes that the multiple at which the stock has been trading is “unwarranted,” though it believes that Roku’s results will be strong and better than expected in the near term and says “it is hard to fight momentum… for now.”\nSTOCK PLAYS:\nOther publicly traded companies in the space include\nFox\n(\nFOXA), FuboTV\n(FUBO)\n, Apple\n(\nAAPL), AMC Networks\n(\nAMCX), and Comcast\n(\nCMCSA).\nPublished first on\nTheFly\n– the ultimate source for real-time, market-moving breaking financial news.\nTry Now>>\nSee the top stocks recommended by analysts >>\nRead More on FOX:\nFox Corp. downgraded to Neutral from Buy at Arete\nNow Streaming: Warner Bros. Discovery reports 6% boost in Q4 DTC revenue\nNow Streaming: Amazon MGM gains creative control of James Bond franchise\nDisney’s ESPN Strikes Out of MLB Deal\nNow Streaming: Roku reports upbeat Q4 results\nView Comments\nTerms\nand\nPrivacy Policy\nPrivacy & Cookie Settings\nMore Info\nRecommended Stories"
        }
    ],
    "2025-03-07": [
        {
            "date": "2025-03-07",
            "title": "Apple (AAPL) Beats Stock Market Upswing: What Investors Need to Know",
            "link": "https://finance.yahoo.com/news/apple-aapl-beats-stock-market-224519470.html",
            "pub_time": "2025-03-07 22:45:19",
            "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nUpgrade Now\nApple (AAPL) Beats Stock Market Upswing: What Investors Need to Know\nZacks Equity Research\nFri, Mar 7, 2025, 11:45 PM\n3 min read\nIn This Article:\nAAPL\n+1.59%\n^GSPC\n+0.55%\nIn the latest market close, Apple (AAPL) reached $239.07, with a +1.59% movement compared to the previous day. The stock outperformed the S&P 500, which registered a daily gain of 0.55%. On the other hand, the Dow registered a gain of 0.52%, and the technology-centric Nasdaq increased by 0.7%.\nPrior to today's trading, shares of the maker of iPhones, iPads and other products had gained 0.9% over the past month. This has outpaced the Computer and Technology sector's loss of 8.51% and the S&P 500's loss of 5.56% in that time.\nInvestors will be eagerly watching for the performance of Apple in its upcoming earnings disclosure. The company is forecasted to report an EPS of $1.61, showcasing a 5.23% upward movement from the corresponding quarter of the prior year. Simultaneously, our latest consensus estimate expects the revenue to be $93.67 billion, showing a 3.22% escalation compared to the year-ago quarter.\nFor the full year, the Zacks Consensus Estimates are projecting earnings of $7.27 per share and revenue of $406.63 billion, which would represent changes of +7.7% and +3.99%, respectively, from the prior year.\nInvestors should also take note of any recent adjustments to analyst estimates for Apple. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\nThe Zacks Rank system, ranging from #1 (Strong Buy) to #5 (Strong Sell), possesses a remarkable history of outdoing, externally audited, with #1 stocks returning an average annual gain of +25% since 1988. Over the past month, there's been a 0.1% fall in the Zacks Consensus EPS estimate. Apple is currently a Zacks Rank #3 (Hold).\nWith respect to valuation, Apple is currently being traded at a Forward P/E ratio of 32.36. For comparison, its industry has an average Forward P/E of 12.06, which means Apple is trading at a premium to the group.\nWe can additionally observe that AAPL currently boasts a PEG ratio of 2.34. The PEG ratio is akin to the commonly utilized P/E ratio, but this measure also incorporates the company's anticipated earnings growth rate. By the end of yesterday's trading, the Computer - Micro Computers industry had an average PEG ratio of 1.58.\nStory Continues\nThe Computer - Micro Computers industry is part of the Computer and Technology sector. With its current Zacks Industry Rank of 36, this industry ranks in the top 15% of all industries, numbering over 250.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days.\nClick to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nView Comments\nTerms\nand\nPrivacy Policy\nPrivacy & Cookie Settings\nMore Info\nRecommended Stories"
        },
        {
            "date": "2025-03-07",
            "title": "Apple Delays Siri Upgrade Indefinitely as AI Concerns Escalate",
            "link": "https://finance.yahoo.com/news/apple-confirms-delay-ai-infused-184329588.html",
            "pub_time": "2025-03-07 22:14:48",
            "content": "Unlock stock picks and a broker-level newsfeed that powers Wall Street.\nUpgrade Now\nApple Delays Siri Upgrade Indefinitely as AI Concerns Escalate\nMark Gurman\nFri, Mar 7, 2025, 11:14 PM\n4 min read\nIn This Article:\nAAPL\n+1.59%\n(Bloomberg) -- Apple Inc.’s turmoil in its AI division reached new heights on Friday, with the company delaying promised updates to the Siri digital assistant for the foreseeable future.\nMost Read from Bloomberg\nNJ College to Merge With State School After Financial Stress\nTrump Administration Plans to Eliminate Dozens of Housing Offices\nRepublican Mayor Braces for Tariffs: ‘We Didn’t Budget for This’\nWhere New York City's Zoning Reform Will Add Housing\nHow Upzoning in Cambridge Broke the YIMBY Mold\nApple said that features introduced last June, including Siri’s ability to tap into a user’s personal information to answer queries and have more precise control over apps, will now be released sometime in “the coming year.” The iPhone maker hadn’t previously set a public deadline for the capabilities, but they were initially planned for the iOS 18.4 software update this April.\nBloomberg News reported on Feb. 14 that Apple was struggling to finish developing the features and the enhancements would be postponed until at least May — when iOS 18.5 is due to arrive. Since then, Apple engineers have been racing to fix a rash of bugs in the project. The work has been unsuccessful, according to people involved in the efforts, and they now believe the features won’t be released until next year at the earliest.\nIn the lead-up to the latest delay, software chief Craig Federighi and other executives voiced strong concerns internally that the features didn’t work properly — or as advertised — in their personal testing, said the people, who asked not to be identified discussing internal matters. An Apple spokeswoman declined to comment.\nSome within Apple’s AI division believe that work on the features could be scrapped altogether, and that Apple may have to rebuild the functions from scratch. The capabilities would then be delayed until a next-generation Siri that Apple hopes to begin rolling out in 2026.\nThe company first demonstrated the features during its Worldwide Developers Conference last June, part of an unveiling of the Apple Intelligence AI platform. At the same annual event this year, Apple isn’t planning to show off any big AI breakthroughs. Instead, it will focus on integrating Apple Intelligence into more of its apps.\nThe delays — especially of announced features — are embarrassing for Apple and add more evidence to the idea that the company is struggling in artificial intelligence. They also threaten to set back work on future improvements.\nApple had been planning to make Siri more ChatGPT-like and conversational next year. But now only the initial underpinnings for that upgrade are expected to be ready by 2026, during the iOS 19 release cycle. The actual interface that users experience likely won’t arrive until iOS 20 in 2027, the people said.\nStory Continues\nBloomberg News reported earlier this week that Apple employees are questioning whether Chief Executive Officer Tim Cook or the company’s board needs to take action to change the leadership of the AI group. They believe that, short of major changes, Apple will continue to fall behind. Earlier this year, the company tapped veteran software leader Kim Vorrath to help the team.\nThe delays mark an especially public setback for Apple because the company has been advertising the not-yet-ready features in TV commercials for nearly six months. When the company introduced the iPhone 16 last fall, it did so by selling customers on the idea that the device was “built from the ground up for Apple Intelligence.” Now, the core features for that experience might not be available until months after the iPhone 17 debuts.\nIn anticipation of customer frustration, the company sent guidance to its AppleCare support representatives on Friday. “If customers ask about the timing of these Siri features, reiterate that we anticipate rolling them out in the coming year,” the memo said.\nThere are also concerns internally that fixing Siri will require having more powerful AI models run on Apple’s devices. That could strain the hardware, meaning Apple either has to reduce its set of features or make the models run more slowly on current or older devices. It would also require upping the hardware capabilities of future products to make the features run at full strength.\nSiri did get some refinements as part of the rollout of iOS 18, including an integration with OpenAI’s ChatGPT chatbot and a text-based option called Type to Siri. It also includes Apple product knowledge and a new glowing interface, but those features don’t represent changes to the underlying technology.\nThe slow pace threatens to put Apple further behind Amazon.com Inc. in the voice assistant market. That company will begin rolling out its highly anticipated Alexa+ this month. Samsung Electronics Co. and Alphabet Inc.’s Google have also built AI deeply into their devices.\nMost Read from Bloomberg Businessweek\nAn All-American Finance Empire Drew Billions—and a Regulator’s Attention\nGreenland Voters Weigh Their Election’s Most Important Issue: Trump\nThe Mysterious Billionaire Behind the World’s Most Popular Vapes\nSnack Makers Are Removing Fake Colors From Processed Foods\nRich People Are Firing a Cash Cannon at the US Economy—But at What Cost?\n©2025 Bloomberg L.P.\nView Comments\nTerms\nand\nPrivacy Policy\nPrivacy & Cookie Settings\nMore Info\nRecommended Stories"
        }
    ]
}